"auto"

// 编曲
var compose = [
    [5],
    [11, "."],
    [7, "_"],
    [12, "_"],
    [11, "_"],
    [5, "_"],
    [3, "_"],
    [6],
    ["-"],
    [4],
    [0, "_"],
    [6, "_"],
    [12, "."],
    [11, "_"],
    [7, "_"],
    [6, "_"],
    [5, "_"],
    [4, "_"],
    [3],
    ["-"],
    ["-"],
    [5, "."],
    [11, "."],
    [7, "_"],
    [12, "_"],
    [11, "_"],
    [5, "_"],
    [3, "_"],
    [6],
    ["-"],
    [4],
    [0, "_"],
    [6, "_"],
    [12, "_"],
    [7],
    [12],
    [14],
    [7],
    [11],
    ["-"],
    ["-"],
    [13, "_"],
    [12, "_"],
    [7],
    ["-"],
    [6, "_"],
    [7, "_"],
    [11, "_"],
    [6, "_"],
    [7],
    ["-"],
    [5],
    [0, "_"],
    [5, "_"],
    [4, "_"],
    [5, "_"],
    [6, "."],
    [6, "_"],
    [12, "."],
    [11, "_"],
    [7],
    ["-"],
    [12],
    [12, "."],
    [7, "_"],
    [5, "_"],
    [5, "_"],
    [4, "_"],
    [5, "_"],
    [13, "_"],
    ["-"],
    [11, "_"],
    [6, "_"],
    [7, "_"],
    [11, "_"],
    [7],
    [12],
    [11],
    [6],
    [5],
    ["-"],
    ["-"],
    [13, "_"],
    [12, "_"],
    [11],
    ["-"],
    [5, "."],
    [3, "_"],
    [6],
    ["-"],
    [4, "_"],
    [0, "_"],
    [12, "_"],
    [11, "_"],
    [7],
    ["-"],
    [6],
    [5],
    [5],
    ["-"],
    ["-"],
    [5],
    [13],
    ["-"],
    [12],
    [5],
    [11],
    [0],
    [7, "."],
    [7, "_"],
    [6, "."],
    [5, "_"],
    [6],
    [12],
    [12],
    ["-"],
    ["-"],
]

// 高音 Do 在手机上的 X 坐标
var x = 540;
// 高音 Do 在手机上的 Y 坐标
var y = 620;
// 每两个按键在中心点的 X 轴距离，一般无需修改
var xStep = 210;
// 每两个按键在中心点的 Y 轴距离，一般无需修改
var yStep = 160;
// 弹奏速度，单位为毫秒
var speed = 500;

// Script
console.show();
sleep(2333);
for (let index = 0; index < compose.length; index++) {
    var note = compose[index];
    console.log([index, note]);

    if (0 === note[0]) {
        // rest
    } else if ("-" === note[0]) {
        sleep(speed * 0.5);
    } else if (note[0] > 10) {
        var hNote = note[0] - 10;
        var tapX = x + ((hNote - 1) * xStep);
        var tapY = y;
        click(tapX, tapY);
    } else if (note[0] > 0) {
        var hNote = note[0];
        var tapX = x + ((hNote - 1) * xStep);
        var tapY = y + (yStep * 1);
        click(tapX, tapY);
    } else {
        var hNote = -note[0];
        var tapX = x + ((hNote - 1) * xStep);
        var tapY = y + (yStep * 2);
        click(tapX, tapY);
    }

    if (2 === note.length) {
        if ("." === note[1]) {
            sleep(speed * 1.5)
        }
        if ("_" === note[1]) {
            sleep(speed * 0.5)
        }
    } else {
        sleep(speed * 1)
    }
}
sleep(2333);
console.hide();